app/controllers/phones_controller.rb

  def index
    @phones = Phone.all
---
SELECT "phones".* FROM "phones"

  def set_phone
    @phone = Phone.find(params[:id])
---
SELECT "phones".* FROM "phones" WHERE "phones"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]